#include<stdio.h>
main()
{
        int x,l1,l2,l3,l4,l5,l6;
        float l;
		printf("请输入总收入:\n"); 
		scanf("%d",&x);
		l1=0.1*100000;
		l2=l1+100000*0.075;
		l3=l2+200000*0.0500;
		l4=l3+400000*0.0300;
		l5=l4+600000*0.0150;
		if(x<=100000)
		
	    l=l1*0.1;
		
		else if(x<=200000)
		
		l=l1+(x-100000)*0.075;
		
		else if(x<=400000)
		
		l=l2+(x-200000)*0.05;
		
		else if(x<=600000)
		
		l=l3+(x-400000)*0.03;
		
		else if(x<=1000000)
		
		l=l4+(x-600000)*0.015;
		
		else if(x>1000000)
		
		l=l5+(x-1000000)*0.010;
		
		printf("当纯利润为%lf",l);
}
